---
kind: method
id: M:Autodesk.Revit.DB.FabricationServiceButton.Dispose
source: html/ad50735d-6899-6e64-d2c5-a1fde30589ff.htm
---
# Autodesk.Revit.DB.FabricationServiceButton.Dispose Method

Releases all resources used by the FabricationServiceButton

## Syntax (C#)
```csharp
public void Dispose()
```